In [7]:
import pymongo 
import pandas as pd  
import json
client = pymongo.MongoClient("mongodb://localhost:27017")
print(client)

MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True)

In [15]:
# empdb = client["EmpDB"]
# empcol = mydb["Employees"]
# empdoc = {'id':107, 'name':'Anurag','depart':'DE/DS'}
# empcol.insert_one(empdoc)

In [8]:
print(client.list_database_names())

['EmpDB', 'StudentDB', 'admin', 'config', 'local']

In [9]:
df=pd.read_csv(r"StudentData.csv", error_bad_lines=False)
df.head()

,age,gender,name,course,roll,marks,email
0,28,Female,Hubert Oliveras,DB,2984,59,Annika Hoffman_Naoma Fritts@OOP.com
1,29,Female,Toshiko Hillyard,Cloud,12899,62,Margene Moores_Marylee Capasso@DB.com
2,28,Male,Celeste Lollis,PF,21267,45,Jeannetta Golden_Jenna Montague@DSA.com
3,29,Female,Elenore Choy,DB,32877,29,Billi Clore_Mitzi Seldon@DB.com
4,28,Male,Sheryll Towler,DSA,41487,41,Claude Panos_Judie Chipps@OOP.com

In [10]:
data=df.to_dict(orient='records')
df.tail()

,age,gender,name,course,roll,marks,email
995,28,Female,Celeste Lollis,DB,9952416,59,Gonzalo Ferebee_Jalisa Swenson@DB.com
996,29,Female,Somer Stoecker,Cloud,9962277,84,Clementina Menke_Paris Hutton@OOP.com
997,28,Male,Tamera Blakley,DSA,9971217,26,Anna Santos_Claude Panos@PF.com
998,28,Female,Tamera Blakley,MVC,9982779,71,Toshiko Hillyard_Anna Santos@DSA.com
999,29,Female,Jenna Montague,PF,9991617,23,Anna Santos_Jenna Montague@DB.com

In [11]:
studDB = client['StudentDB']

In [12]:
studDB.Student.insert_many(data)

In [13]:
c=studDB.find({'course':'DB'})
for i in c:
    print(i)

TypeError: 'Collection' object is not callable. If you meant to call the 'find' method on a 'Database' object it is failing because no such method exists.